package com.yeahwap.netgame.domain;

public class SzfErrorCode {
	private static final String[][] VALIDCODE = { { "101", "md5 验证失败" },
			{ "102", "订单号重复" }, { "103", "恶意用户" }, { "104", "序列号，密码简单验证失败" },
			{ "105", "密码正在处理中" }, { "106", "系统繁忙，暂停提交" },
			{ "107", "多次支付时卡内余额不足" }, { "109", "des 解密失败" },
			{ "201", "证书验证失败" }, { "501", "插入数据库失败" }, { "502", "插入数据库失败" },
			{ "200", "请求成功,正在支付，请稍后" }, { "902", "商户参数不全" },
			{ "903", "商户 ID 不存在" }, { "904", "商户没有激活" },
			{ "905", "商户没有使用该接口的权限" }, { "906", "商户没有设置 密钥（privateKey）" },
			{ "907", "商户没有设置 DES 密钥" },
			{ "908", "该笔订单已经处理完成（订单状态已经为确定的状态：成功 或者 失败）" },
			{ "909", "该笔订单不符合重复支付的条件" }, { "910", "服务器返回地址，不符合规范" },
			{ "911", "订单号，不符合规范" }, { "912", "非法订单" }, { "913", "该地方卡暂时不支持" },
			{ "914", "支付金额非法" }, { "915", "卡面额非法" }, { "916", "商户不支持该充值卡的支付" },
			{ "917", "参数格式不正确" }, { "0", "网络连接失败" }, { "-1", "连接运营商失败" } };
	private static final String[][] PAYCODE = { { "200", "支付成功" },
			{ "201", "您输入的充值卡密码错误" }, { "202", "您输入的充值卡已被使用" },
			{ "203", "您输入的充值卡密码非法" }, { "204", "您输入的卡号或密码错误次数过多" },
			{ "205", "卡号密码正则不匹配或者被禁止" }, { "206", "本卡之前被提交过，本次订单失败，不再继续处理" },
			{ "207", "暂不支持该充值卡的支付" }, { "208", "您输入的充值卡卡号错误" },
			{ "209", "您输入的充值卡未激活（生成卡）" },
			{ "210", "您输入的充值卡已经作废（能查到有该卡，但是没卡的信息）" }, { "211", "您输入的充值卡已过期" },
			{ "212", "您选择的卡面额不正确" }, { "213", "该卡为特殊本地业务卡，系统不支持" },
			{ "214", "该卡为增值业务卡，系统不支持" }, { "215", "新生卡" }, { "216", "系统维护" },
			{ "217", "接口维护" }, { "218", "运营商系统维护" }, { "219", "系统忙，请稍后再试" },
			{ "220", "未知错误" }, { "221", "本卡之前被处理完毕，本次订单失败，不再继续处理" } };

	public static String getValidCode(String code) {
		for (int i = 0; i < VALIDCODE.length; i++) {
			if (VALIDCODE[i][0].equals(code)) {
				return VALIDCODE[i][1];
			}
		}
		
		return "未定义";
	}

	public static String getPayCode(String code) {
		for (int i = 0; i < PAYCODE.length; i++) {
			if (PAYCODE[i][0].equals(code)) {
				return PAYCODE[i][1];
			}
		}
		
		return "未定义";
	}
	
	public static void main(String[] args) {
		System.out.println(getValidCode("909"));
	}
}
